{
    "Benjamin Parfitt": {
        "url": "https://www.linkedin.com/in/benjamin-parfitt/",
        "raw_profile": ""
    },
    "Michael Cox": {
        "url": "https://www.linkedin.com/in/michael-cox/",
        "raw_profile": " Michael Cox \n\n Starting Something New!\n Somerville, Massachusetts, United States  Contact info\n 500+ connections\n \n \n Erik Modahl and Neal Sarraf are mutual connectionsErik Modahl and Neal Sarraf are mutual connections\n \n Message\n \n Save in Sales Navigator\n \n More\n AboutAbout\n I'm a product guy. And I get things done.\n \n I've worked on a variety of teams, directly responsible for getting dozens of software applications built. Mostly those are small teams trying to get a new product from zero to one. I've done every role - I've been the manager of the dev team, the pusher of the spreadsheets, and the guy who puts his headphones on and codes for hours on end. Honestly I enjoy the whole process.\n \n For a prettier version of what you see here, visit my site at https://mdcox.net/I'm a product guy. And I get things done. I've worked on a variety of teams, directly responsible for getting dozens of software applications built. Mostly those are small teams trying to get a new product from zero to one. I've done every role - I've been the manager of the dev team, the pusher of the spreadsheets, and the guy who puts his headphones on and codes for hours on end. Honestly I enjoy the whole process. For a prettier version of what you see here, visit my site at https://mdcox.net/…see more\n ActivityActivity\n 676 followers676 followers\n \n Loaded 1 Comments post\n ⚙ Michael Cox commented on a post • 5mo5mo\n Congrats Nico, that sounds awesome!\n Show all comments\n ExperienceExperience\n Paddle logo\n VP of EngineeringVP of Engineering\n Paddle · Full-timePaddle · Full-time\n May 2022 - Sep 2023 · 1 yr 5 mosMay 2022 - Sep 2023 · 1 yr 5 mos\n Boston, Massachusetts, United States · HybridBoston, Massachusetts, United States · Hybrid\n - Lead the engineering transition and integration of the ProfitWell team and product over to Paddle\n \n  - Took ownership of the Platform teams including SRE, Architecture, and Engineering Ops consisting of roughly 20 engineers\n \n  - Pushed for teams to work more cross-functionally, leading the effort to improve code quality and architecture across the organization- Lead the engineering transition and integration of the ProfitWell team and product over to Paddle - Took ownership of the Platform teams including SRE, Architecture, and Engineering Ops consisting of roughly 20 engineers - Pushed for teams to work more cross-functionally, leading the effort to improve code quality and architecture across the organization…see more\n Engineering Management, DevOps and +1 skill\n ProfitWell by Paddle logo\n VP of EngineeringVP of Engineering\n ProfitWell · Full-timeProfitWell · Full-time\n Mar 2018 - May 2022 · 4 yrs 3 mosMar 2018 - May 2022 · 4 yrs 3 mos\n Boston, MA · On-siteBoston, MA · On-site\n ProfitWell was bootstrapped and was acquired by Paddle in May 2022 🎉\n \n  - Reporting to the Co-Founder/CPO, oversaw the growth of the engineering team from an initial size of 5-6 engineers to a robust team of 30, with extrememly high retention\n \n  - Intrumental in building a product now used by nearly 30% of all SaaS companies\n \n  - Instituted comprehensive engineering best practices, including agile processes, continuous integration, one-click deployments, code reviews, and automated testing\n \n  - Established a transparent communication channel between the engineering, product, and sales teams, facilitating efficient decision-making and goal alignment\n \n  - Championed the transition to containerized applications with Docker and orchestrated deployments with Kubernetes, leading to an improvement in system resource efficiency and enabling seamless scaling of applications\n \n - Introduced and standardized Infrastructure as Code practices, using tools like Terraform, Docker, and helm, enabling consistent and repeatable environment setups and reducing manual provisioning errors\n \n - Lead the security function of the business by mentoring engineers on security-first coding practices, acting as the DPO, and getting the product compliant with SOC2 and PCIProfitWell was bootstrapped and was acquired by Paddle in May 2022 🎉 - Reporting to the Co-Founder/CPO, oversaw the growth of the engineering team from an initial size of 5-6 engineers to a robust team of 30, with extrememly high retention - Intrumental in building a product now used by nearly 30% of all SaaS companies - Instituted comprehensive engineering best practices, including agile processes, continuous integration, one-click deployments, code reviews, and automated testing - Established a transparent communication channel between the engineering, product, and sales teams, facilitating efficient decision-making and goal alignment - Championed the transition to containerized applications with Docker and orchestrated deployments with Kubernetes, leading to an improvement in system resource efficiency and enabling seamless scaling of applications - Introduced and standardized Infrastructure as Code practices, using tools like Terraform, Docker, and helm, enabling consistent and repeatable environment setups and reducing manual provisioning errors - Lead the security function of the business by mentoring engineers on security-first coding practices, acting as the DPO, and getting the product compliant with SOC2 and PCI…see more\n MySQL, Engineering Management and +9 skills\n \n Paddle acquires ProfitWell for $200M to bring analytics and retention tools to its SaaS payments platform | TechCrunchPaddle acquires ProfitWell for $200M to bring analytics and retention tools to its SaaS payments platform | TechCrunch\n Hudson Collaborative, Inc. logo\n Software Engineering ConsultantSoftware Engineering Consultant\n Hudson Collaborative, Inc. · Full-timeHudson Collaborative, Inc. · Full-time\n Sep 2010 - Feb 2018 · 7 yrs 6 mosSep 2010 - Feb 2018 · 7 yrs 6 mos\n Greater Boston AreaGreater Boston Area\n I've contracted with a variety of companies, but mostly local startups, helping to build applications that are fast, robust, and scalable. I made long term relationships with companies where I could make a significant impact augmenting their existing development team. See https://mdcox.net/work\n \n Sample projects include:\n \n  - As a primary architect with a very small team within a Fortune 100 healthcare company, created a web and mobile app for consumer health and wellness. Our chosen stack included React Native (iOS and Android), react.js web (ES6), node.js, MongoDB, Neo4j, and RabbitMQ. All of this was architected with a microservices approach in the company's first secure HIPAA compliant AWS deploy.\n \n  - Rebuilt and consolidated the API for a local high-growth startup that was starting to feel growing pains with their existing API. The new API is written in the latest node.js with ES7 async/await, leveraging Swagger / OpenAPI for API validation and documentation. Tests and coverage in jest. The API also integrates with Kong as an API gateway for consolidated authentication and rate limiting. All of this is deployed to Google Cloud Platform using Kubernetes.\n \n  - Built the initial product of a new startup (end to end) from a repeat entrepreneur. I had a lot of leeway on the technology stack and I've chosen a mobile-friendly isomorphic (SSR) React application. The API is GraphQL using Apollo's frameworks with TypeScript throughout. Tests in jest as well as some e2e smoke tests using cypress. Deployments are handled via Circle CI to AWS ECS into a Docker Swarm.\n \n  - Created a custom WYSIWYG editor using React, Redux, and Immutable.js for a Boston startup which is a core component of their product. The editor uses Draft.js for rich text editing where necessary, but is otherwise built from the ground up. Unit tests in enzyme with mocha.I've contracted with a variety of companies, but mostly local startups, helping to build applications that are fast, robust, and scalable. I made long term relationships with companies where I could make a significant impact augmenting their existing development team. See https://mdcox.net/work Sample projects include: - As a primary architect with a very small team within a Fortune 100 healthcare company, created a web and mobile app for consumer health and wellness. Our chosen stack included React Native (iOS and Android), react.js web (ES6), node.js, MongoDB, Neo4j, and RabbitMQ. All of this was architected with a microservices approach in the company's first secure HIPAA compliant AWS deploy. - Rebuilt and consolidated the API for a local high-growth startup that was starting to feel growing pains with their existing API. The new API is written in the latest node.js with ES7 async/await, leveraging Swagger / OpenAPI for API validation and documentation. Tests and coverage in jest. The API also integrates with Kong as an API gateway for consolidated authentication and rate limiting. All of this is deployed to Google Cloud Platform using Kubernetes. - Built the initial product of a new startup (end to end) from a repeat entrepreneur. I had a lot of leeway on the technology stack and I've chosen a mobile-friendly isomorphic (SSR) React application. The API is GraphQL using Apollo's frameworks with TypeScript throughout. Tests in jest as well as some e2e smoke tests using cypress. Deployments are handled via Circle CI to AWS ECS into a Docker Swarm. - Created a custom WYSIWYG editor using React, Redux, and Immutable.js for a Boston startup which is a core component of their product. The editor uses Draft.js for rich text editing where necessary, but is otherwise built from the ground up. Unit tests in enzyme with mocha.…see more\n MySQL, SQL Server and +6 skills\n CTOCTO\n hodgsonConsulting, LLC · Full-timehodgsonConsulting, LLC · Full-time\n Feb 2005 - Aug 2010 · 5 yrs 7 mosFeb 2005 - Aug 2010 · 5 yrs 7 mos\n Washington D.C. Metro AreaWashington D.C. Metro Area\n Originally hired as a technical project manager when this full-service web consulting agency was fairly young, I found myself naturally taking on more responsibilities and was promoted to CTO when one of the original cofounders left the company a short time after I started. I didn't write any production code, but instead managed a development team of up to 30 people and had three main areas of focus:\n \n  - Hiring the best set of programmers, designers, and project managers I could find\n  - Making sure we put out a quality product to our clients, on time and on budget\n  - Pushing the company forward on the latest technology to stay competitive in the market\n \n About half my time was spent meeting with both current and prospective clients, consulting on the best solution for their needs, serving as a mix of business analyst and technical architect. The other half was spent working with our development staff and project managers, reviewing projects and code.\n \n During my tenure I estimate I oversaw the development of between 150 and 200 software projects. Clients were mostly federal and local government, associations, and non-profits - as is to be expected for an agency in the Washington, DC area. However, we also did our fair share of work for public and private companies, as well as funded startups.Originally hired as a technical project manager when this full-service web consulting agency was fairly young, I found myself naturally taking on more responsibilities and was promoted to CTO when one of the original cofounders left the company a short time after I started. I didn't write any production code, but instead managed a development team of up to 30 people and had three main areas of focus: - Hiring the best set of programmers, designers, and project managers I could find - Making sure we put out a quality product to our clients, on time and on budget - Pushing the company forward on the latest technology to stay competitive in the market About half my time was spent meeting with both current and prospective clients, consulting on the best solution for their needs, serving as a mix of business analyst and technical architect. The other half was spent working with our development staff and project managers, reviewing projects and code. During my tenure I estimate I oversaw the development of between 150 and 200 software projects. Clients were mostly federal and local government, associations, and non-profits - as is to be expected for an agency in the Washington, DC area. However, we also did our fair share of work for public and private companies, as well as funded startups.…see more\n .NET, C# and +9 skills\n Infolinx logo\n Project ManagerProject Manager\n Infolinx System Solutions · Full-timeInfolinx System Solutions · Full-time\n Mar 2004 - Feb 2005 · 1 yrMar 2004 - Feb 2005 · 1 yr\n Washington D.C. Metro AreaWashington D.C. Metro Area\n Infolinx is a records management software company, primarily selling to large companies and government agencies in the DC area. My role was client implementation. I hired and trained temp workers (and a small number of permanent staff) to label, input, scan, and organize physical file folders. Folders were then synchronized with the Infolinx software and managed with RFID. Clients were mostly large institutions such as the IRS, NSF, and ManTech International.Infolinx is a records management software company, primarily selling to large companies and government agencies in the DC area. My role was client implementation. I hired and trained temp workers (and a small number of permanent staff) to label, input, scan, and organize physical file folders. Folders were then synchronized with the Infolinx software and managed with RFID. Clients were mostly large institutions such as the IRS, NSF, and ManTech International.…see more\n EducationEducation\n Rochester Institute of Technology logo\n Rochester Institute of TechnologyRochester Institute of Technology\n BS, Information TechnologyBS, Information Technology\n 2000 - 20042000 - 2004\n SkillsSkills\n Python (Programming Language)Python (Programming Language)\n \n VP of Engineering at ProfitWellVP of Engineering at ProfitWell\n \n Endorse\n KubernetesKubernetes\n \n VP of Engineering at ProfitWellVP of Engineering at ProfitWell\n \n Endorse\n Show all 43 skills\n RecommendationsRecommendations\n Recommend ⚙ Michael\n ReceivedReceived\n GivenGiven\n Bob MacWilliams profile picture\n Bob MacWilliamsBob MacWilliams\n · 2ndSecond degree connection\n Self-employed software engineering consultant; Composer/guitaristSelf-employed software engineering consultant; Composer/guitarist\n September 26, 2016, Bob managed ⚙ Michael directlySeptember 26, 2016, Bob managed ⚙ Michael directly\n Michael was an essential contributor on my superb development team for 3+ years, first at the healthcare startup Healthrageous, and then at the Humana Boston Digital Experience Center, after Humana acquired Healthrageous. He is the complete package - topnotch developer, software architect, and leader. He works very hard to stay on top of ongoing developments in the rapidly evolving software engineering domain. A pleasure to work with, I would recommend him without hesitation.Michael was an essential contributor on my superb development team for 3+ years, first at the healthcare startup Healthrageous, and then at the Humana Boston Digital Experience Center, after Humana acquired Healthrageous. He is the complete package - topnotch developer, software architect, and leader. He works very hard to stay on top of ongoing developments in the rapidly evolving software engineering domain. A pleasure to work with, I would recommend him without hesitation.\n Glenn G. profile picture\n Glenn G.Glenn G.\n · 2ndSecond degree connection\n Experienced technology professional who can function as a hands on developer through executive level managementExperienced technology professional who can function as a hands on developer through executive level management\n August 29, 2016, Glenn was ⚙ Michael’s clientAugust 29, 2016, Glenn was ⚙ Michael’s client\n I've had the pleasure of working with Michael Cox on and off for the past 5 years and would put him in the top 1% of people I've worked with over a 30 year period in the technology business. His ability to communicate, break down complex problems and provide solid, straightforward, and elegant solutions is a rare combination to find in an individual. He consistently provides a professional perspective on the challenges put forth to him and inevitably solves them quickly, solidly and with a smile. A great person to work with and highly recommend him to anyone looking for a resource to own something completely or become part of a team. "
    }
}